// src/data/interviewCards.js
import nakataniImage from '../assets/images/nakatani.png';

const interviewCards = [
  {
    id: 1,
    title: "学校行事でのいじめがきっかけで不登校に。葛藤しつつも、第3の居場所と趣味が心の支えに",
    description: "中学1年生から不登校を経験し、一度全日制高校に進学するも再度不登校へ。そこから通信制高校への転校を決意した中谷悠人さんに、家族や友人との関わり、そして「自分の道」を見つけるまでの葛藤をお聞きしました。",
    authorName: "まりぽり",
    authorInitial: "R",
    date: "2025.07.01",
    image: nakataniImage,
    
    // ▼ 詳細ページ用 ▼
    fullName: "中谷 悠人",
    profile: "福井県在住、通信制高校3年生",
    interviewDate: "2025年7月",
    
    introduction: [
      "今回は、現在通信制高校3年生の中谷悠人さんにインタビューしました。悠人さんは、中学1年生から不登校を経験し、一度全日制高校に進学するも、再度不登校を経験。そこから学生生活の送り方や居場所のあり方を家族で見つめ直し、通信制高校への転校を決意しました。",
      "現在は通信制高校の授業と両立しながら、学校の垣根を越えた学生団体や演劇、音楽活動などに打ち込む悠人さん。アクティブに活躍している彼ですが、現在に至るまでの葛藤や選択、家族や先生・友人との関わりについてお話をお聞きしました。"
    ],

    tableOfContents: [
      "学校行事でのいじめがきっかけで不登校に。葛藤しつつも、第3の居場所と趣味が心の支えに",
      "全日制高校進学後、二度目の不登校を経験。通信制高校への転校を機に視野が広がる",
      "行けなかった時期、母が前向きに寄り添ってくれたことで救われた",
      "一人の人間として接してくれた友人と、選択肢を与えてくれた恩師への感謝",
      "「あとは、なるようになる！」不登校の経験から得られた人生の糧"
    ],

    sections: [
      {
        heading: "学校行事でのいじめがきっかけで不登校に。葛藤しつつも、第3の居場所と趣味が心の支えに",
        qaList: [
          {
            question: "ー悠人さんが最初に学校に行きづらくなったのは中学生の時とお聞きしました。何かきっかけはありましたか？",
            answer: "悠人さん：中学1年生の秋に、軽いいじめに遭ったことです。体育祭のダンスに真面目に取り組まないクラスメイトからいじられて、気持ちがすごく落ち込んで…そこから学校に行けなくなりました。\n\n全日制の高校に進学してからは、しばらく頑張っていたのですが、頑張りすぎてしまって、不登校になりました。"
          },
          {
            question: "ー学校に行けていない時間は、どのように過ごしていましたか？",
            answer: "悠人さん：学校に行けなくなってすぐは、昼夜逆転の生活を送っていました。昼に起きて、朝に寝る、みたいな…\n\nその中でSNSやゲームで知り合ったオンライン上で友達とやり取りをしたり、歌が好きなので、家に一人で居る時間はカラオケアプリで歌ったりもしていました。"
          },
          {
            question: "ー自分の興味のあることで、気分転換をしていたんですね。他に、何か気分転換ができることはありましたか？",
            answer: "悠人さん：母が、家と学校以外の第3の居場所をいくつか提案してくれました。不登校になって半年ほど経ったときに、母から勧めてもらった場所の1つの『NPO法人 もりのほうかごがっこう』という、小学生の子どもたちを対象とした「森の中で自由に遊ぶ」というイベントがとても楽しかったんです。同世代だけでなく、年下の子たちを交えた会話が楽しくて。\n\nそれを母に話したら、次のイベントからは「ジュニアスタッフ」として参加することになり、3年ほど行き続けていました。『もりのほうかごがっこう』の代表の方が不登校に理解がある方で、優しく接してくれましたし、異年齢の人と話すことも刺激があって、とても楽しかったです。\n\nあとは、オタ活ですね！ 福井県出身の作家さんが書いたライトノベル『千歳くんはラムネ瓶のなか』を読み始めて、そこからライトノベルにドハマりしました。200～300冊は読んだと思います。小さい頃から読書が好きで、物語を想像することも好きだったので、実際に演劇用の短編台本を書くことにも繋がりました。"
          },
          {
            question: "ー居場所を提案してもらえたり、好きなことがたくさんあったことが大きかったのですね。不登校の時の話に戻りますが、気分転換をしつつ学校から離れた生活を送っていたとき、どんな気持ちでしたか？",
            answer: "悠人さん：何かに打ち込んでいるときはそれに熱中できるのですが、一旦自分のしていることを横に置いたときに「学校に行けてない」「自分は普通じゃない」など、ネガティブな気持ちが出てきたり、母や祖父母に「迷惑をかけているな」と申し訳なくなったり、だけど「学校に行きたいのに行けないんだよな」と思う気持ちがループしていました。"
          }
        ]
      },
      {
        heading: "全日制高校進学後、二度目の不登校を経験。通信制高校への転校を機に視野が広がる",
        qaList:[          
          {
            question: "ー不登校がきっかけで、自分の進路選択に影響はありましたか？",
            answer: "悠人さん：普通に中学校に行けていたら、もう少し成績も良かったのかなと思っていました。高校受験は自分の出来る範囲で頑張って、全日制の県立高校に進学しました。「高校では頑張ってみよう」と思っていて、機械関係の実習もあって楽しかったのですが、張り切りすぎてしまったのか、途中でダウンしてしまって。そこから再度不登校になりました。\n\n出席日数が足りなくなってしまい、「留年して今の高校に居続けるか」「転校して新しい環境でやり直すか」を考えたとき、別の環境の方が新しい経験もできるということで転校を決意しました。そこで全日制か通信制かでも迷ったのですが、「通信制の方が合っているかもしれない」と思い、通信制高校に転校しました。"
          },
          {
            question: "ー今は通信制高校もたくさんあり、選択肢も多いですよね。今在籍している学校を選んだ決め手などはありますか？",
            answer: "悠人さん：一番の決め手は、学校でVRゴーグルが支給されることですね。VRゴーグルを使った授業があって、バーチャル空間上で理科の実験ができたり、歴史の授業で有名なお城を近くで見ることができたり、近未来的な授業が面白そうだと思いました。他にも、インターネット関係で活躍している技術者の方から、プログラミングやイラストなどの授業を受けられたりもするんですよ。通信制なので、授業と自分の活動との両立も出来ますし、選択肢や視野が広がって、今の自分には合っているなと思っています。"
          },
          {
            question: "ー自分に合った学校選択が出来てよかったですね！ 今の悠人さんは、学校の垣根を越えた学生団体の活動をしたり、演劇をしたりなど、とても生き生きとしているように感じています。辛い時期もあったと思いますが、少しずつ心が元気になっていったきっかけなどはありますか？",
            answer: "悠人さん：そうだなあ…いつの間にか、でした。\n\n要因を挙げるとすると、『もりのほうかごがっこう』でジュニアスタッフとして活動していたことと、中学3年生の時に劇団に入ったことですかね。『もりのほうかごがっこう』では、異年齢の人たちと一緒に活動できて、今までになかった新しい刺激をもらえて、コミュニケーションもどんどん好きになっていきました。昼夜逆転の生活を送っていた時期ではあったのですが、活動がある日は生活リズムを直すことが出来ました。\n\n演劇だと、同年代の仲間達と1つのものを作り上げることがすごく楽しくて、学校ではできなかった経験ができていることが良かったなと思います。\n\n高校の時は、親友の存在がターニングポイントでした。同じ高校にいた友人なのですが、転校してから学生イベントで再会したんです。そこから同じ学校だったときよりも仲良くなって、今では毎週会うほどです。その時期に彼から誘われて、学生団体を設立したことも自分の中で大きかったです。"
          }
        ]
      },
      {
        heading: "行けなかった時期、母が前向きに寄り添ってくれたことで救われた",
        qaList:[          
          {
            question: "ー不登校になったときに「学校に行けない」ということを、家族に話せましたか？",
            answer: "悠人さん：母・祖父母は私が学校に行けないことに対して理解はしてくれていたのですが、他人も含めて話すことはできなかったですね。学校を休み始めて、しばらくは話せなかったです。元々受け身の性格なのもあって、母が歩み寄ってくれて、居場所を見つけたり、外に出たりできるようになりました。"
          },
          {
            question: "ー不登校の時期、家族との関係性はどうでしたか？ 「学校に行きなさい」と言われたりなどはありましたか？",
            answer: "悠人さん：最初の1ヶ月ほどは母と祖母から「学校に行きなさい」と言われていました。祖父はあまり干渉しないタイプだったのですが、時折話しかけてくれていました。学校に行けなくなって半年ほど経って、『もりのほうかごがっこう』など居場所ができたときくらいから、母からは「学校に行きなさい」とは言われなくなりました。"
          },
          {
            question: "ー家族から言われて傷ついたこと、やってほしくなかったこと・言ってほしくなかったことはありますか？",
            answer: "悠人さん：何を言われても、自分が悪いと思って受け入れていましたが、「学校に行かないと将来がなくなるよ」と言われたときは辛かったです。「自分の人生は終わってしまうのか…」と思ったり…"
          },
          {
            question: "ー家族から言われて救われたことはありますか？",
            answer: "悠人さん：母が「不登校でもいいよね」と考えてくれて、寄り添ってくれたことです。ずっと母は寄り添ってくれていたんですが、「いいよね」という前向きなスタンスで居てくれたときは嬉しかったなと思います。"
          }
        ]
      },
      {
        heading: "一人の人間として接してくれた友人と、選択肢を与えてくれた恩師への感謝",
        qaList:[          
          {
            question: "ー友達や先生から言われて傷ついたこと、やってほしくなかったことはありますか？",
            answer: "悠人さん：いじめの原因（学校行事でのクラスメイトからのいじり）さえなければ、と思います。先生は親身になってくれました。"
          },
          {
            question: "ー友達や先生に言われて救われたことはありますか？",
            answer: "悠人さん：高校受験の時期だけ学校に戻れていたのですが、面接練習のときに同じ部活の子が「久しぶり！」と声をかけてくれたことです。不登校関係なく「久しぶりに会った友達」として接してくれたのが嬉しくて。不登校ということを気にせずに、一人の人間として自分を見てくれている人がいるということに救われました。\n\nまた、高校を辞めるかどうかで迷っていたときに、先生が「辞めてもいい」と言ってくれたことも救われたことのひとつです。先生自身は「クラスの生徒全員を卒業まで見たい」と思ってくれていたようですが…それでも、選択肢を与えてくれたことは嬉しかったな。"
          },
          {
            question: "ー自分を一人の人間として見てくれていることや、悠人さんの人生にとってベストな選択肢を探してくれたことは大きいですね。不登校の経験や、不登校がきっかけで学校を変えたことなどを、誰かに話すことはできましたか？",
            answer: "悠人さん：相手から聞かれない限りは話さないかな。自分から話すようなことでも無いと思いますし。関係性を作る上で話さなきゃいけないときは、話しています。"
          }
        ]
      },
      {
        heading: "「あとは、なるようになる！」不登校の経験から得られた人生の糧",
        qaList:[          
          {
            question: "ー悠人さんが、不登校の経験から得たものはありますか？",
            answer: "悠人さん：学校から外れたことで、学校に行っているだけではできない体験・経験ができたことが大きいです。課外活動や趣味、オタ活など…自分の好きなものにたくさん触れることができました。\n\nまた、年上の人や年下の子など、自分とは違う世界の人たちと接することができて、普通に学校に行っているだけではできない経験をさせてもらえたなと思います。"
          },
          {
            question: "ー学校から離れたことを通して、悠人さんに合っていた世界に導かれたように感じられますね。学生の段階で異年齢の人とのコミュニケーションを大切にできていることはとても大切なように思えます。最後に、読んでいる方に伝えたいことありますか？",
            answer: "悠人さん：自分がここまで自由にできたのは、周りの大人や友達がたくさん引っ張ってきてくれたから。自分の力で解決しようと思ったこともあったけど「そんなことないよ」って。誰かに頼ることも重要なことであって、自分ひとりだけでは一方的な面しか見られないけれど、誰かを介すことで、いろんな角度からいろんな視点を入れて、時には問題を解決することができるときもありますし、問題が増えることもありますが…誰かに話してみることも一つの選択肢としていいのかなと。あとは、なるようになります！"
          },
          {
            question: "ー「あとは、なるようになる」大切な考えですね！ 貴重なお話を聞かせていただき、ありがとうございました！",
            answer: "悠人さん：こちらこそ、ありがとうございました！"
          }
        ]
      }
    ],

    writer: {
      name: "えみか",
      description: "ライター / インタビュアー"
    }
  }
];

export default interviewCards;